<?php
/****************************************\
 * GreenCall plugin for Masochist-Board *
 *   Ver 0.1 By Losses Don and Sky Lark *
 *                  midasfree@gmail.com *
 *                 losses.don@gmail.com *
 ****************************************/

$plugin_info = [
    "IDENTIFICATION" => "sakura.losses.kimoji.name"
];

$plugin_injector = [
    "HOOK-AFTER_LIST" => "HOOK-AFTER_VIEW.php",
    "HOOK-AFTER_POST" => "HOOK-AFTER_VIEW.php"
];

$plugin_config = [
    "KM_LIST" => ['o(-`д´- ｡)', '(；￣Д￣）', '(#ಠQಠ#)', '(¬_¬)', '( ಠ ಠ )',
        '(･｀ｪ´･)つ', 'ヽ(｀⌒´メ)ノ', '(¬д¬。)', '(/-(ｴ)-＼)', '≖‿≖',
        ' (。-`ω´-)', '(σ-`д･´)', 'ψ(｀∇´)ψ', '＼(-___________-;)／', '(^・ω・^ )',
        '´･ᴗ･`', '≖‿≖', 'ヽ(‘ー`)ノ', 'ヾ(・◇・)ﾉθ～♪', '( ´∀`)σ)Д`)',
        'Σ>―(〃°ω°〃)♡→', '(　ﾟ∀ﾟ) ﾉ♡', '_(:3 」∠ )_', 'ε٩(๑> ₃ <)۶з', 'ლ(╹◡╹ლ)',
        '(✪ω✪)', '(⁰▿⁰)', '･*･:≡(　ε:)', '٩(｡・ω・｡)﻿و', '(,,ﾟДﾟ)',
        '( • ̀ω•́ )', '(・ε・)', '(｢･ω･)｢', '٩(๑•̀ω•́๑)۶', '(°ཀ°)',
        '( ×ω× )', '(ﾟ々｡)', ' (☍﹏⁰) ', '(;´༎ຶД༎ຶ`)', '(／‵Д′)／~ ╧╧',
        '(ﾒﾟДﾟ)ﾒ', 'ヾ(*ΦωΦ)ツ', '(     д     ) ﾟﾟ', '-`д´-', '(｡ŏ_ŏ)',
        '(((ﾟДﾟ;)))', '(゜皿。)', 'Σ(ﾟдﾟ)', 'Σ(ﾟДﾟ；≡；ﾟдﾟ)', '／/( ◕‿‿◕ )＼',
        '(*´∀`)~♥', '(〃∀〃)'
    ],
    "KM_SCOPE" => 'all'
];
